In [1]:
import pandas as pd
from pathlib import Path

In [3]:
# Load no Dataframe
DATA_FILE_PATH = Path('data/data_raw.csv')

df = pd.read_csv(DATA_FILE_PATH)

In [ ]:
# Salvando o dataframe
df.to_parquet('data/data_pandas_copy.parquet')

In [25]:
# Entendendo o dataframe
df.describe()

,vendas,id_cliente,idade_cliente,data_compra,preco,id_vendedor
count,10000.000000,10000.000000,10000.000000,10000,10000.000000,10000.000000
mean,49.876000,2990.260400,53.249900,2024-01-01 18:15:50.400000256,2523.182561,149.576300
min,1.000000,1000.000000,18.000000,2023-01-01 00:00:00,50.520000,100.000000
25%,25.000000,1995.750000,35.000000,2023-07-05 00:00:00,1281.030000,124.000000
50%,50.000000,2951.500000,53.000000,2024-01-02 00:00:00,2537.135000,150.000000
75%,75.000000,3990.000000,71.000000,2024-07-01 00:00:00,3761.345000,175.000000
max,99.000000,4999.000000,89.000000,2024-12-31 00:00:00,4999.790000,199.000000
std,28.611478,1152.505295,20.850538,NaN,1429.034195,29.254825

In [29]:
df.dtypes

vendas                         int64
id_cliente                     int64
idade_cliente                  int64
data_compra           datetime64[ns]
produto                       object
data_ultima_compra            object
preco                        float64
id_vendedor                    int64
dtype: object

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   vendas              10000 non-null  int64
 1   id_cliente          10000 non-null  int64
 2   idade_cliente       10000 non-null  int64
 3   data_compra         10000 non-null  datetime64[ns]
 4   produto             10000 non-null  object
 5   data_ultima_compra  10000 non-null  object
 6   preco               10000 non-null  float64
 7   id_vendedor         10000 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(2)
memory usage: 625.1+ KB

In [27]:
df.shape

(10000, 8)

In [6]:
# Olha as 5 primeiras linhas
df.head(5)

,sales,customer_id,customer_age,purchase_date,product,last_purchase_date,price,seller_id
0,52,1511,86,2024-10-07,Laptop,2022-05-29,2534.07,199
1,93,4985,52,2023-12-10,Smartphone,2023-09-20,1879.78,182
2,15,3092,69,2024-01-06,TV,2022-07-06,4844.32,112
3,72,4179,31,2023-02-02,Smartphone,2022-01-20,4705.96,147
4,61,3266,80,2024-01-09,Tablet,2023-01-08,4766.52,159

In [7]:
# Olha as 10 ultimas linhas
df.tail(10)

,sales,customer_id,customer_age,purchase_date,product,last_purchase_date,price,seller_id
9990,38,3099,57,2024-12-01,Tablet,2023-02-04,4597.37,193
9991,84,1373,63,2024-11-29,Headphones,2024-05-20,219.64,118
9992,34,4597,57,2024-03-13,Laptop,2024-10-22,520.78,177
9993,44,1930,79,2024-11-30,Headphones,2022-11-25,4198.73,126
9994,30,1155,35,2024-09-27,TV,2023-09-27,2488.88,129
9995,17,2565,29,2023-02-06,Tablet,2023-01-18,4699.31,144
9996,59,2113,31,2024-10-22,Smartphone,2022-03-19,2335.18,177
9997,10,4974,78,2023-04-16,Smartphone,2022-11-28,4634.31,130
9998,99,3726,29,2024-09-06,TV,2022-06-12,1236.17,135
9999,84,3398,44,2023-08-20,Tablet,2022-05-30,3101.43,138

In [9]:
# Renomeando o nome das colunas
rename_dict = {
    'sales': 'vendas',
    'customer_id': 'id_cliente',
    'customer_age': 'idade_cliente',
    'purchase_date': 'data_compra',
    'product': 'produto',
    'last_purchase_date': 'data_ultima_compra',
    'price': 'preco',
    'seller_id': 'id_vendedor'
}
df = df.rename(columns=rename_dict)
df.columns

Index(['vendas', 'id_cliente', 'idade_cliente', 'data_compra', 'produto',
       'data_ultima_compra', 'preco', 'id_vendedor'],
      dtype='object')

In [10]:
# Seleciona uma coluna especifica
df.produto

0           Laptop
1       Smartphone
2               TV
3       Smartphone
4           Tablet
           ...
9995        Tablet
9996    Smartphone
9997    Smartphone
9998            TV
9999        Tablet
Name: produto, Length: 10000, dtype: object

In [12]:
# Mudando o tipo de uma coluna
df['data_compra'] = pd.to_datetime(df['data_compra'])

In [17]:
# Faz um filtro para vendas após 2023-09-09
df.query('data_compra >= "2023-09-09"')

,vendas,id_cliente,idade_cliente,data_compra,produto,data_ultima_compra,preco,id_vendedor
0,52,1511,86,2024-10-07,Laptop,2022-05-29,2534.07,199
1,93,4985,52,2023-12-10,Smartphone,2023-09-20,1879.78,182
2,15,3092,69,2024-01-06,TV,2022-07-06,4844.32,112
4,61,3266,80,2024-01-09,Tablet,2023-01-08,4766.52,159
7,87,3362,57,2024-03-31,Laptop,2024-12-21,4729.64,197
...,...,...,...,...,...,...,...,...
9992,34,4597,57,2024-03-13,Laptop,2024-10-22,520.78,177
9993,44,1930,79,2024-11-30,Headphones,2022-11-25,4198.73,126
9994,30,1155,35,2024-09-27,TV,2023-09-27,2488.88,129
9996,59,2113,31,2024-10-22,Smartphone,2022-03-19,2335.18,177
9998,99,3726,29,2024-09-06,TV,2022-06-12,1236.17,135

In [19]:
# Contando as vendas por vendedor
df.id_vendedor.value_counts(normalize=True)

id_vendedor
101    0.0124
193    0.0124
197    0.0122
122    0.0118
156    0.0117
        ...
100    0.0085
120    0.0085
149    0.0085
198    0.0077
116    0.0075
Name: proportion, Length: 100, dtype: float64

In [20]:
# Selecionando 3 colunas, id_cliente, produto, preço
df[['id_cliente', 'produto', 'preco']]

      id_cliente     produto    preco
0           1511      Laptop  2534.07
1           4985  Smartphone  1879.78
2           3092          TV  4844.32
3           4179  Smartphone  4705.96
4           3266      Tablet  4766.52
...          ...         ...      ...
9995        2565      Tablet  4699.31
9996        2113  Smartphone  2335.18
9997        4974  Smartphone  4634.31
9998        3726          TV  1236.17
9999        3398      Tablet  3101.43

[10000 rows x 3 columns]

In [21]:
df.loc[:, ['id_cliente', 'produto', 'preco']]

      id_cliente     produto    preco
0           1511      Laptop  2534.07
1           4985  Smartphone  1879.78
2           3092          TV  4844.32
3           4179  Smartphone  4705.96
4           3266      Tablet  4766.52
...          ...         ...      ...
9995        2565      Tablet  4699.31
9996        2113  Smartphone  2335.18
9997        4974  Smartphone  4634.31
9998        3726          TV  1236.17
9999        3398      Tablet  3101.43

[10000 rows x 3 columns]

In [22]:
# Selecionando apenas as colunas que comecem com id
df.filter(regex="^id", axis=1)

      id_cliente  idade_cliente  id_vendedor
0           1511             86          199
1           4985             52          182
2           3092             69          112
3           4179             31          147
4           3266             80          159
...          ...            ...          ...
9995        2565             29          144
9996        2113             31          177
9997        4974             78          130
9998        3726             29          135
9999        3398             44          138

[10000 rows x 3 columns]

In [24]:
df[[col for col in df.columns if col.startswith("id")]]

      id_cliente  idade_cliente  id_vendedor
0           1511             86          199
1           4985             52          182
2           3092             69          112
3           4179             31          147
4           3266             80          159
...          ...            ...          ...
9995        2565             29          144
9996        2113             31          177
9997        4974             78          130
9998        3726             29          135
9999        3398             44          138

[10000 rows x 3 columns]

In [34]:
# estatisticas
df.vendas.mean()

np.float64(49.876)

In [39]:
# Olhando a quantidade de nulos
df.isna().mean()

vendas                0.0
id_cliente            0.0
idade_cliente         0.0
data_compra           0.0
produto               0.0
data_ultima_compra    0.0
preco                 0.0
id_vendedor           0.0
dtype: float64

In [41]:
# Preenchendo os valores faltantes
df = df.fillna(-9)

In [42]:
# Exluindo os valores nulos
df = df.dropna()

In [44]:
# Removendo linhas duplicadas
df = df.drop_duplicates()

In [46]:
# Criando uma coluna
df['total'] = df.vendas * df.preco
df.total

0       131771.64
1       174819.54
2        72664.80
3       338829.12
4       290757.72
          ...
9995     79888.27
9996    137775.62
9997     46343.10
9998    122380.83
9999    260520.12
Name: total, Length: 10000, dtype: float64

In [49]:
# Passando uma função em uma coluna
def foobar(value: float) -> int:
    return value / 100

df['preco'].apply(foobar)

0       25.3407
1       18.7978
2       48.4432
3       47.0596
4       47.6652
         ...
9995    46.9931
9996    23.3518
9997    46.3431
9998    12.3617
9999    31.0143
Name: preco, Length: 10000, dtype: float64

In [52]:
df.groupby(by='produto')['vendas'].mean()

produto
Headphones    50.137189
Laptop        50.294057
Smartphone    49.419587
TV            49.422042
Tablet        50.130661
Name: vendas, dtype: float64

In [54]:
df.groupby(by=['produto', 'id_vendedor'])['idade_cliente'].mean()

produto     id_vendedor
Headphones  100            46.307692
            101            55.750000
            102            44.000000
            103            56.269231
            104            57.608696
                             ...
Tablet      195            57.450000
            196            36.545455
            197            54.607143
            198            56.000000
            199            50.166667
Name: idade_cliente, Length: 500, dtype: float64